{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "trainable": true, "name": "conv2d_1", "padding": "valid", "dilation_rate": [1, 1], "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "trainable": true, "name": "conv2d_2", "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "trainable": true, "name": "conv2d_3", "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "trainable": true, "name": "conv2d_4", "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.5, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 128, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "trainable": true, "name": "conv2d_5", "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 128, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "trainable": true, "name": "conv2d_6", "padding": "valid", "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "kernel_regularizer": null, "units": 1024, "activation": "relu", "trainable": true, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.2, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "kernel_regularizer": null, "units": 1024, "activation": "relu", "trainable": true, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.2, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "kernel_regularizer": null, "units": 7, "activation": "softmax", "trainable": true, "name": "dense_3", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null}}], "keras_version": "2.2.2"}